# 数组中占比超过一半的元素称之为主要元素。给定一个整数数组，找到它的主要元素。若没有，返回-1。 
#
#  示例 1：
#  输入：[1,2,5,9,5,9,5,5,5]
# 输出：5 
#
#  示例 2： 
#  输入：[3,2]
# 输出：-1 
#
#  示例 3： 
#  输入：[2,2,1,1,1,2,2]
# 输出：2 
#
#  说明： 
# 你有办法在时间复杂度为 O(N)，空间复杂度为 O(1) 内完成吗？ 
#  Related Topics 位运算 数组 分治算法 
#  👍 68 👎 0

"""
思路: 去重后进行遍历, 校验每个元素出现的次数并和列表长度进行比较
"""


class Solution(object):
    def majorityElement(self, nums):
        """
        :type nums: List[int]
        :rtype: int
        """
        for i in set(nums):
            if nums.count(i) > len(nums) / 2:
                return i
        return -1


if __name__ == '__main__':
    nums = [1, 2, 5, 9, 5, 9, 5, 5, 5]
    Solution().majorityElement(nums)
